export interface INumAndDen {
  numerator?: string;
  denominator?: string;
}

export interface ILesson {
  time?: string;
  lesson?: INumAndDen;
}

export interface ILessons {
  day: string;
  lessons?: Array<ILesson>;
}

export const data: Array<ILessons> = [
  {
    day: "monday",
    lessons: [
      {
        time: "11:40-13:15",
        lesson: {
          numerator:
            "лаб. Электро-гидро-пневмоприводы и автоматика доц.Романов 117С 28.10, 25.11",
        },
      },

      {
        time: "13:35-15:10",
        lesson: {
          numerator:
            "лаб. Электро-гидро-пневмоприводы и автоматика доц.Романов 117С 28.10,25.11; лаб. Автоматизация производственных процессов в машиностроении асс. Городничева Е.В. 213а С 16.09, 14.10, 11.11, 09.12",

          denominator:
            "лаб. Технология обработки и программирования на станках с ЧПУ доц.Грибов Н.В. 117 С 09.09, 07.10, 04.11, 02.12",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "лаб. Автоматизация производственных процессов в машиностроении асс. Городничева Е.В. 213а С 16.09, 14.10, 11.11, 09.12",

          denominator:
            "лаб. Технология обработки и программирования на станках с ЧПУ доц.Грибов Н.В. 117 С 09.09, 07.10, 04.11, 02.12",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          denominator:
            "л. Проектирование аддитивных технологических машин и комплексов доц.Романов И.Н.",
        },
      },

      {
        time: "18:50-20:15",
        lesson: {
          denominator:
            "пр. Проектирование аддитивных технологических машин и комплексов доц.Романов И.Н.",
        },
      },
    ],
  },

  {
    day: "tuesday",
    lessons: [
      {
        time: "13:35-15:10",
        lesson: {
          numerator:
            "л. Проектировние технологической оснастки, средств механизации и автоматизации доц.Грибов Н.В. 125а С",

          denominator:
            "л. Автоматизация производственных процессов в машиностроении ст.преп.Меркулов Ю.А. 213а С",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "л. Технология обработки и программирования на станках с ЧПУ доц.Грибов Н.В. 125а С",

          denominator:
            "л. Технология обработки и программирования на станках с ЧПУ доц.Грибов Н.В. 125а С",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          numerator:
            "пр. Технология обработки и программирования на станках с ЧПУ доц.Грибов Н.В. 117 С",
        },
      },
    ],
  },

  {
    day: "wednesday",
    lessons: [
      {
        time: "13:35-15:10",
        lesson: {
          numerator: "л. Основы патентоведения ст.преп.Меркулов Ю.А. 213а С",

          denominator:
            "л. Проектирование механообрабатывающих технологических машин и комплексов доц.Чесноков Р.А. 267 С",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "пр. Проектировние технологической оснастки, средств механизации и автоматизации доц.Грибов Н.В. 117 С",

          denominator:
            "пр. Проектирование механообрабатывающих технологических машин и комплексов доц.Чесноков Р.А. 267 С",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          numerator:
            "л. Проектирование механообрабатывающих технологических машин и комплексов доц.Чесноков Р.А. 346 С",
        },
      },
    ],
  },

  {
    day: "thursday",
    lessons: [
      {
        time: "13:35-15:10",
        lesson: {
          numerator:
            "л. Электро- гидро- пневмоприводы и автоматика доц.Романов И.Н. 125а С.",

          denominator:
            "л. Электро- гидро- пневмоприводы и автоматика доц.Романов И.Н. 125а С.",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "пр. Проектирование аддитивных технологических машин и комплексов доц.Романов И.Н. 117 С.",

          denominator:
            "пр. Электро- гидро- пневмоприводы и автоматика доц.Романов И.Н. 117 С.",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          numerator:
            "лаб. Основы патентоведения ст.преп.Меркулов Ю.А. 213а С 05.09, 03.10, 31.10, 28.11",
        },
      },

      {
        time: "18:40-20:15",
        lesson: {
          numerator:
            "лаб. Основы патентоведения ст.преп.Меркулов Ю.А. 213а С 05.09, 03.10, 31.10, 28.11",
        },
      },
    ],
  },

  {
    day: "friday",
    lessons: [
      {
        time: "13:35-15:10",
        lesson: {
          numerator:
            "л. Автоматизация производственных процессов в машиностроении ст.преп.Меркулов Ю.А. 213а С",

          denominator:
            "л. Автоматизация производственных процессов в машиностроении ст.преп.Меркулов Ю.А. 213а С",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "пр. Автоматизация производственных процессов в машиностроении ст.преп.Меркулов Ю.А. 213а С",

          denominator:
            "пр. Автоматизация производственных процессов в машиностроении ст.преп.Меркулов Ю.А. 213а С",
        },
      },
    ],
  },

  {
    day: "saturday",
    lessons: [
      {
        time: "08:10-09:45",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },

      {
        time: "09:55-11:30",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },

      {
        time: "11:40-13:15",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },

      {
        time: "13:35-15:10",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },
    ],
  },
];
