export interface INumAndDen {
  numerator?: string;
  denominator?: string;
}

export interface ILesson {
  time?: string;
  lesson?: INumAndDen;
}

export interface ILessons {
  day: string;
  lessons?: Array<ILesson>;
}

export const data: Array<ILessons> = [
  {
    day: "monday",
    lessons: [
      {
        time: "13:35-15:10",
        lesson: {
          numerator: "л.Математические модели процессов и систем доц.Сосулин Ю.А. 125а С",

          denominator: "л.Математические модели процессов и систем доц.Сосулин Ю.А. 125а С",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator: "л.САПР технологических процессов доц.Грибов Н.В. 117а С",

          denominator:
            "пр.Проектирование технологической оснастки, средств мехацизации и автоматизации доц.Грибов Н.В. 117 С",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          numerator: "пр.САПР технологических процессов доц.Грибов Н.В. 117а С",

          denominator: "л.САПР технологических процессов доц.Грибов Н.В. 125а С",
        },
      },
    ],
  },

  {
    day: "tuesday",
    lessons: [
      {
        time: "1ё:40-13:15",
        lesson: {
          numerator: "лаб.САПР технологических процессов доц.Грибов Н.В. 117 С",
        },
      },

      {
        time: "13:35-15:10",
        lesson: {
          numerator: "лаб.САПР технологических процессов доц.Грибов Н.В. 117 С",

          denominator:
            "л.Прикладное программное обеспечение в системах автоматизации доц.Романов И.Н. 121 С",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "л.Прикладное программное обеспечение в системах автоматизации доц.Романов И.Н. 121 С",

          denominator: "лаб.Математические модели процессов и систем доц.Сосулин Ю.А. 117 С",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          denominator: "лаб.Математические модели процессов и систем доц.Сосулин Ю.А. 117 С",
        },
      },
    ],
  },

  {
    day: "wednesday",
    lessons: [
      {
        time: "13:35-15:10",
        lesson: {
          numerator:
            "л.Проектирование механообрабатывающих технологических машин и комплексов доц.Чесноков Р.А. 448 С",

          denominator:
            "л.Проектирование механообрабатывающих технологических машин и комплексов доц.Чесноков Р.А. 346 С",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "л.Проектирование механообрабатывающих технологических машин и комплексов доц.Чесноков Р.А. 265 С 12.02, 12.03, 09.04, 07.05",

          denominator:
            "л.Проектная деятельность в информационных технологиях доц.Дятлов Р.Н. 117а С",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          numerator:
            "л.Проектирование механообрабатывающих технологических машин и комплексов доц.Чесноков Р.А. 265 С 12.02, 12.03, 09.04, 07.05",
          denominator:
            "пр.Проектирование механообрабатывающих технологических машин и комплексов доц.Чесноков Р.А. 448 С",
        },
      },
    ],
  },

  {
    day: "thursday",
    lessons: [
      {
        time: "15:20-16:55",
        lesson: {
          numerator: "л.Проектная деятельность в информационных технологиях доц.Дятлов Р.Н. 121 С",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          numerator:
            "л.Проектирование технологической оснастки, средств мехацизации и автоматизации доц.Грибов Н.В. 125а С",
        },
      },

      {
        time: "18:40-20:15",
        lesson: {
          numerator:
            "пр.Проектирование технологической оснастки, средств мехацизации и автоматизации доц.Грибов Н.В. 117 С",
        },
      },
    ],
  },

  {
    day: "friday",
    lessons: [
      {
        time: "11:40-13:15",
        lesson: {
          numerator:
            "лаб.Проектирование технологической оснастки, средств механизации и автоматизации доц.Грибов Н.В. 117 С 14.02, 14.03, 11.04, 09.05   лаб.Проектная деятельность в информационных технологиях доц.Дятлов Р.Н. 117 С 28.02, 28.03, 25.04, 23.05",
        },
      },

      {
        time: "13:35-15:10",
        lesson: {
          numerator:
            "лаб.Проектирование технологической оснастки, средств механизации и автоматизации доц.Грибов Н.В. 117 С 14.02, 14.03, 11.04, 09.05   лаб.Проектная деятельность в информационных технологиях доц.Дятлов Р.Н. 117 С 28.02, 28.03, 25.04, 23.05",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          denominator:
            "лаб.Прикладное программное обеспечение в системах автоматизации доц.Романов И.Н. 117 С",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          denominator:
            "лаб.Прикладное программное обеспечение в системах автоматизации доц.Романов И.Н. 117 С",
        },
      },
    ],
  },

  {
    day: "saturday",
    lessons: [
      {
        time: "08:10-09:45",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },

      {
        time: "09:55-11:30",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },

      {
        time: "11:40-13:15",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },

      {
        time: "13:35-15:10",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },
    ],
  },
];
