export interface INumAndDen {
  numerator?: string;
  denominator?: string;
}

export interface ILesson {
  time?: string;
  lesson?: INumAndDen;
}

export interface ILessons {
  day: string;
  lessons?: Array<ILesson>;
}

export const data: Array<ILessons> = [
  {
    day: "monday",
    lessons: [
      {
        time: "13:35-15:10",
        lesson: {
          numerator:
            "л. Промышленные роботы-манипуляторы и транспортные системы ст. преп.Цветков А.А. 117а С",

          denominator:
            "л. Промышленные роботы-манипуляторы и транспортные системы ст. преп.Цветков А.А. 102л С",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "пр. Системы и средства технологического и метрологического контроля производства проф.Чернов Е.И. 338С",

          denominator:
            "со смены расп. пр. Системы и средства технологического и метрологического контроля производства проф.Чернов Е.И. 338С",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          denominator:
            "лаб. Электро-гидро-пневмоприводы и автоматика доц.Романов И.Н. 213а С 26.02, 25.03, 22.04, 20.05",
        },
      },

      {
        time: "18:50-20:15",
        lesson: {
          denominator:
            "лаб. Электро-гидро-пневмоприводы и автоматика доц.Романов И.Н. 213а С 26.02, 25.03, 22.04, 20.05",
        },
      },
    ],
  },

  {
    day: "tuesday",
    lessons: [
      {
        time: "11:40-13:15",
        lesson: {
          denominator:
            "лаб.Промышленные роботы-манипуляторы и траспортные системы ст.преп.Цветков А.А. 213а С 13.02, 12.03, 09.04, 07.05",
        },
      },

      {
        time: "13:35-15:10",
        lesson: {
          numerator:
            "л. Системы и средства технологического и метрологического контроля производства проф.Чернов Е.И. 267 С",

          denominator:
            "лаб.Промышленные роботы-манипуляторы и траспортные системы ст.преп.Цветков А.А. 213а С 13.02, 12.03, 09.04, 07.05",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "со смены расп. пр.Базы данных и СУБД доц.Дятлов Р.Н. 117 С",

          denominator: "л. Технология машиностроения доц.Грибов Н.В. 125а С",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          numerator:
            "лаб. Технология машиностроения доц.Грибов Н.В. 125а С 20.02, 19.03, 16.04, 14.05",

          denominator:
            "пр. Проектирование механообрабатывающих цехов доц. Грибов Н.В. 117 С",
        },
      },

      {
        time: "18:50-20:15",
        lesson: {
          numerator:
            "лаб. Технология машиностроения доц.Грибов Н.В. 125а С 20.02, 19.03, 16.04, 14.05",
        },
      },
    ],
  },

  {
    day: "thursday",
    lessons: [
      {
        time: "13:35-15:10",
        lesson: {
          denominator:
            "Со смены расп.пр.Методы, средства и системы управления качеством доц.Грибов Н.В. 117 С",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "л. Проектирование механообрабатывающих цехов доц. Грибов Н.В. 121 С",

          denominator: "пр. Технология машиностроения доц.Грибов Н.В. 117 С",
        },
      },

      {
        time: "17:05-18:40",
        lesson: {
          numerator: "пр. Технология машиностроения доц.Грибов Н.В. 117 С",

          denominator:
            "л.Методы, средства и системы управления качеством доц.Грибов Н.В. 121 С",
        },
      },
    ],
  },

  {
    day: "friday",
    lessons: [
      {
        time: "13:35-15:10",
        lesson: {
          numerator: "л. Технология машиностроения доц.Грибов Н.В. 117а С",

          denominator:
            "л. Электро-гидро-пневмоприводы и автоматика доц.Романов И.Н. 213а С",
        },
      },

      {
        time: "15:20-16:55",
        lesson: {
          numerator:
            "со смены расп.пр.Методы, средства и системы управления качеством доц.Грибов Н.В. 117 С",

          denominator:
            "пр. Электро-гидро-пневмоприводы и автоматика доц.Романов И.Н. 213а С",
        },
      },
    ],
  },

  {
    day: "saturday",
    lessons: [
      {
        time: "08:10-09:45",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },

      {
        time: "09:55-11:30",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },

      {
        time: "11:40-13:15",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },

      {
        time: "13:35-15:10",
        lesson: {
          denominator: "пр.НИР практика/Научно-исследовательская работа",
        },
      },
    ],
  },
];
